testCase/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    cavityRight
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    DIAPHRAGM
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    cavityTop
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    orificeRight
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    domainBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    domainRight
    {
        type            zeroGradient;
    }
    domainTop
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
