testCase/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//dynamicFvMeshLibs ("libdynamicMyClassFvMesh.so");
dynamicFvMesh      dynamicMotionSolverFvMesh;

//dynamicFvMesh     dynamicMyClassFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");
//solver            displacementLaplacian;

//diffusivity       inverseDistance (inlet);

solver            velocityLaplacian;

velocityLaplacianCoeffs
{
diffusivity       uniform;
}


/*dynamicMyClassFvMeshCoeffs
{
     amplitude    0.0005;
     frequency    100;
     refPlaneX    -0.007;     
}*/

// ************************************************************************* //
