testCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 0.001;

vertices
(
(0 0 0.1)//0
(1.5 0 0.1)//1
(22.5 0 0.1)//2
(22.5 7 0.1)//3
(1.5 7 0.1)//4
(0 7 0.1)//5
(0 13 0.1)//6
(1.5 13 0.1)//7
(30 13 0.1)//8
(30 19 0.1)//9
(1.5 19 0.1)//10
(0 19 0.1)//11
(0 0 0)//12
(1.5 0 0)//13
(22.5 0 0)//14
(22.5 7 0)//15
(1.5 7 0)//16
(0 7 0)//17
(0 13 0)//18
(1.5 13 0)//19
(30 13 0)//20
(30 19 0)//21
(1.5 19 0)//22
(0 19 0)//23


/*(0 0 0)//0
(22.47858 0.98156 0)//1
(22.47858 -0.98156 0)//2
(22.47858 0.98156 7)//3
(22.47858 -0.98156 7)//4
(0 0 7)//5
(1.49857 0.06544 7)//6
(1.49857 -0.06544 7)//7
(1.49857 0.06544 13)//8
(1.49857 -0.06544 13)//9
(0 0 13)//10
(44.95716 1.96313 13)//11
(44.95716 0.1.96313 13)//12
(44.95716 1.96313 813)//13
(44.95716 0.1.96313 813)//14
(0 0 813)//15
(1.49857 0.0644 0)//16
(1.49857 -0.0644 0)//17
(1.49857 0.0644 813)//18
(1.49857 -0.0644 813)//19*/
);

blocks
(
hex (0 1 4 5 12 13 16 17) (25  40 1) simpleGrading (0.39 0.5 1)
hex (1 2 3 4 13 14 15 16) (144  40 1) simpleGrading (5 0.5 1)
hex (5 4 7 6 17 16 19 18) (25  48 1) simpleGrading (0.39 1 1)
hex (6 7 10 11 18 19 22 23) (25  120 1) simpleGrading (0.39 0.75 1)
hex (7 8 9 10 19 20 21 22) (400  120 1) simpleGrading (2 0.75 1)

// hex (0 1 4 5 12 13 16 17) (40  50 1) simpleGrading (0.39 0.5 1)
// hex (1 2 3 4 13 14 15 16) (180  50 1) simpleGrading (5 0.5 1)
// hex (5 4 7 6 17 16 19 18) (40  60 1) simpleGrading (0.39 1 1)
// hex (6 7 10 11 18 19 22 23) (40  150 1) simpleGrading (0.39 0.75 1)
// hex (7 8 9 10 19 20 21 22) (500  150 1) simpleGrading (2 0.75 1)
);

edges
(
);

boundary
(
     back
     {
           type symmetry;
           faces
           (
               (0 1 4 5)
               (1 2 3 4)
               (5 4 7 6)
               (6 7 10 11)
               (7 8 9 10)
               /*(0 16 6 5)
               (16 1 3 6)
               (5 6 8 10)
               (10 8 18 15)
               (8 11 13 18)*/
           );
      }
     front
     {
           type symmetry;
           faces
           (
               (12 13 16 17)
               (13 14 15 16)
               (17 16 19 18)
               (18 19 22 23)
               (19 20 21 22)
               /*(0 17 7 5)
               (17 2 4 7)
               (5 7 9 10)
               (10 9 19 15)
               (9 12 14 19)*/
           );
      }
     cavityRight
     {
           type wall;
           faces
           (
               (2 14 15 3)
               /*(1 2 4 3)*/
           );
      }
      DIAPHRAGM
     {
           type wall;
           faces
           (
               (0 12 13 1)
               (1 13 14 2)
               /*(0 16 17 0)
               (16 17 2 1)*/
           );
      }
     cavityTop
     {
           type wall;
           faces
           (
               (4 16 15 3)
               //(6 3 4 7)
           );
      }
     orificeRight
     {
           type wall;
           faces
           (
               (4 16 19 7)
               //(6 7 9 8)
           );
      }
     domainBottom
     {
           type wall;
           faces
           (
               (7 19 20 8)
               //(8 11 12 9)
           );
      }

     domainRight
     {
           type patch;
           faces
           (
               (8 20 21 9)
               //(11 12 14 13)
           );
      }
     domainTop
     {
           type wall;
           faces
           (
               (10 22 21 9)
               (11 23 22 10)
               /*(15 18 19 15)
               (18 19 14 13)*/
           );
      }
     /*axis
     {
           type patch;
           faces
           (
               (0 5 17 12)
               (5 6 18 17)
               (6 11 23 18)
               /*(0 5 5 0)
               (5 10 10 5)
               (10 15 15 10)
           );
      }*/
);

mergePatchPairs
(
);

// ************************************************************************* //
