testCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//application moveDynamicMesh;

application     pimpleDyMFoam;

//startFrom       startTime;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.12;

deltaT          2E-06;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.2;

//libs ("libAngularOscillatingDisplacement.so");
//libs ("libMyPolynomVelocity.so");
libs ("libMyOscillatingVelocity.so");
//libs ("libgroovyBC.so");
// ************************************************************************* //

functions
{

	field_average
	{
        type              fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        enabled         true;
        outputControl   outputTime;
        resetOnOutput   true;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            NusseltNumber
            {
            	mean        on;
            	prime2Mean  on;
            	base        time;
            }

            T
            {
            	mean         on;
            	prime2Mean   on;
            	base         time;
            }
        );
    }

}

// ************************************************************************* //
