testCase/system/controlDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      oriAverageDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    type surfaceFieldValue;
    libs ("libfieldFunctionObjects.so");
    enabled yes;
    log yes;
    writeFields yes;
    regionType faceZone;
    name oriZone;
    operation areaAverage;
// operation weightedAverage;
// weightField phi;
    fields
    (
        UMean
    );
// ************************************************************************* //
