testCase/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pointSync false;

patches
(
        {
        // Name of new patch
          name orificeOpening;

        // Type of new patch
         patchInfo
         {
             type empty;
         }

        // How to construct: either from 'patches' or 'set'
         constructFrom set;

        // If constructFrom = set : name of faceSet
         set inletToPlaneCells;
        }
);

// ************************************************************************* //  
