testCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(pcorr|pcorrFinal)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration off;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
        tolerance        0.02;
        relTol           0.05;
    }

    p
    {
        $pcorr;
        tolerance       1e-4;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-5;
        relTol          0;
    }

  "(U|T)"
  {
    solver PBiCG;// BiCGStab;
    preconditioner DILU;
    tolerance 1e-6;
    relTol          0;
  }

  "(omega|k)"
  {
    solver PBiCG;// BiCGStab;
    preconditioner DILU;
    tolerance 1e-4;
    relTol          0;
  }

    "(UFinal|TFinal)"
    {
    solver PBiCG;// BiCGStab;
    preconditioner DILU;
    tolerance 1e-6;
    relTol          0;
    }

    "(omegaFinal|kFinal)"
    {
      solver PBiCG;// BiCGStab;
      preconditioner DILU;
      tolerance 1e-4;
      relTol          0;
    }

    cellMotionU
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-08;
        relTol           0.001;
    };
}

PIMPLE
{
    correctPhi          yes;
    nOuterCorrectors    100;	//pressure-momentum correction. iterations is one time step
    nCorrectors         2;	//pressure correction interations for one outer loop
    nNonOrthogonalCorrectors 1;
    pRefCell            0;
    pRefValue           0;

    residualControl
    {
        U
        {
                tolerance  1e-5;
                relTol      0;
        }
        p
        {
                tolerance  5e-4;
                relTol      0;
        }
        T
        {
                tolerance 1e-5;
                relTol 0;
        }
        "(k|omega)"
        {
               tolerance 1e-4;
               relTol 0;
        }
     }

}

relaxationFactors
{
    equations
    {
        T     0.9;
        U     0.9;
        p     0.6;
        omega 0.9;
        k     0.9;
    }
}

// ************************************************************************* //
