testCase/system/meanPrimeValDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meanPrimeValDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            fieldAverage;
cleanRestart    true;
functionObjectLibs ( "libfieldFunctionObjects.so" );
enabled         true;
outputControl   outputTime;
outputInterval  20;
fields
(
    U
    {
        mean        on;
        prime2Mean  on;
        base        time;
    }

    p
    {
        mean        on;
        prime2Mean  on;
        base        time;
    }

    NusseltNumber
    {
      mean        on;
      prime2Mean  on;
      base        time;
    }

    T
    {
      mean         on;
      prime2Mean   on;
      base         time;
    }
);
