testCase/system/postAverageDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      postAverageDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
        type            fieldAverage;
        //cleanRestart    true;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        enabled         true;
        timeStart       0;
        timeEnd         0.0011;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

         /*   p
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            NusseltNumber
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            T
            {
                mean         on;
                prime2Mean   on;
                base         time;
            }*/
        );
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
